run/NACA4412__AoA0_kOmegaSST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

															
scale 1;														
                                                                
geometry																
{																
}	

vertices
(
               															
	                     ( 0.0 0.0 0.0) // 0
   ( 1.0 0.0012599999999999777 0.0) // 1
                    ( 1.0 10.0 0.0) // 2
                   ( -10.0 0.0 0.0) // 3
  ( 15.0 0.0012599999999999777 0.0) // 4
                   ( 15.0 10.0 0.0) // 5
  ( 1.0 -0.0012599999999999777 0.0) // 6
 ( 15.0 -0.0012599999999999777 0.0) // 7
                   ( 1.0 -10.0 0.0) // 8
                  ( 15.0 -10.0 0.0) // 9
                    ( 0.0 0.0 1.0) // 10
  ( 1.0 0.0012599999999999777 1.0) // 11
                   ( 1.0 10.0 1.0) // 12
                  ( -10.0 0.0 1.0) // 13
 ( 15.0 0.0012599999999999777 1.0) // 14
                  ( 15.0 10.0 1.0) // 15
 ( 1.0 -0.0012599999999999777 1.0) // 16
( 15.0 -0.0012599999999999777 1.0) // 17
                  ( 1.0 -10.0 1.0) // 18
                 ( 15.0 -10.0 1.0) // 19 
        );
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 300 100 1) simpleGrading (1 1000 1)   //block	0
																													
	hex	(1 4 5 2 11 14 15 12)	( 500 100 1) simpleGrading (15 1000 1)  //block	1														
               											
	hex	(6 7 4 1 16 17 14 11)	( 500 10 1) simpleGrading (15 1 1)      //block	2
																																								
	hex	(8 9 7 6 18 19 17 16)	( 500 100 1) simpleGrading (15 0.001 1) //block	3	
	
	hex	(3 8 6 0 13 18 16 10)	( 300 100 1) simpleGrading (1 0.001 1)  //block	4								
);		

edges																
(																
	arc	2 3	(-7 7 0)									
	arc	12 13	(-7 7 1)
	arc	8 3	(-7 -7 0)									
	arc	18 13	(-7 -7 1)									
																
	spline	0 1													
	(					      

                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.002779436645883411 0 ) 
 ( 0.0009866357836101902 0.0055207177552717215 0 ) 
  ( 0.0022190176933925554 0.008222748469206773 0 ) 
    ( 0.003942649333762649 0.01088417002178607 0 ) 
   ( 0.006155829688391956 0.013503368107714511 0 ) 
     ( 0.008856374615475837 0.0160784843878458 0 ) 
   ( 0.012041619003218151 0.018607430994161976 0 ) 
   ( 0.015708419399974638 0.021087907859323664 0 ) 
      ( 0.01985315711646002 0.0235174226619916 0 ) 
    ( 0.02447174179695788 0.025893313148021294 0 ) 
   ( 0.029559615456007327 0.028212771559787245 0 ) 
    ( 0.03511175697658486 0.030472870881672068 0 ) 
    ( 0.04112268706534028 0.032670592589468826 0 ) 
    ( 0.047586473659998074 0.03480285557535908 0 ) 
    ( 0.05449673778358616 0.036866545908436056 0 ) 
     ( 0.06184665983971649 0.03885854708358349 0 ) 
     ( 0.06962898634270315 0.04077577040896082 0 ) 
     ( 0.07783603707587677 0.04261518518439328 0 ) 
      ( 0.08645971267103159 0.0443738483295568 0 ) 
      ( 0.0954915026015235 0.04604893313185716 0 ) 
    ( 0.10492249358113281 0.047637756799143026 0 ) 
     ( 0.11474337836040116 0.04913780652161402 0 ) 
     ( 0.12494446491176331 0.05054676377018551 0 ) 
     ( 0.13551568599440833 0.05186252658479674 0 ) 
      ( 0.1464466090894303 0.05308322963530017 0 ) 
     ( 0.1577264466954656 0.054207261869206845 0 ) 
    ( 0.16934406697465365 0.055233281594217774 0 ) 
     ( 0.18128800473841744 0.05616022887864529 0 ) 
      ( 0.1935464727622202 0.05698733518901062 0 ) 
     ( 0.20610737341813284 0.05771413022076888 0 ) 
    ( 0.21895831061373222 0.058340445914735764 0 ) 
      ( 0.2320866020255476 0.05886641768784984 0 ) 
    ( 0.24547929161498316 0.059292482941897026 0 ) 
     ( 0.2591231624143632 0.059619376947259925 0 ) 
      ( 0.273004749570484 0.059848126230179294 0 ) 
       ( 0.287110353632798 0.05998003962100488 0 ) 
     ( 0.30142605407311807 0.06001669714708335 0 ) 
       ( 0.315937723023497 0.05995993697694939 0 ) 
     ( 0.3306310392187286 0.059811840642063574 0 ) 
       ( 0.345491502129707 0.05957471677824865 0 ) 
     ( 0.3605044462736979 0.059251083641041015 0 ) 
      ( 0.3756550556873999 0.05884365065728139 0 ) 
      ( 0.3909283785485107 0.05835529927936968 0 ) 
     ( 0.40630934193137186 0.05778906340870699 0 ) 
      ( 0.4217827666821252 0.05714810965101878 0 ) 
      ( 0.43733338239870584 0.0564357176586197 0 ) 
      ( 0.4529458425008854 0.05565526080343141 0 ) 
       ( 0.468604739375493 0.05481018740993586 0 ) 
      ( 0.4842946195818704 0.05390400275952326 0 ) 
      ( 0.4999999991025516 0.05294025205721042 0 ) 
      ( 0.5157053786241185 0.05192250452882564 0 ) 
       ( 0.5313952588331522 0.0508543387918836 0 ) 
      ( 0.5470541557121839 0.04973932961693614 0 ) 
      ( 0.5626666158205507 0.04858103616862363 0 ) 
      ( 0.5782172315450762 0.04738299178742663 0 ) 
      ( 0.593690656305524 0.046148695344689634 0 ) 
       ( 0.6090716196998196 0.0448816041753126 0 ) 
      ( 0.6243449425740935 0.04358512856503597 0 ) 
      ( 0.6394955520026742 0.04226262774290181 0 ) 
      ( 0.6545084961632448 0.04091740730467613 0 ) 
      ( 0.6693689590924875 0.03955271797012939 0 ) 
     ( 0.6840622753076503 0.038171755556445454 0 ) 
     ( 0.6985739442796073 0.036777662031955226 0 ) 
      ( 0.7128896447431308 0.03537352749912887 0 ) 
     ( 0.7269952488302514 0.033962392943514365 0 ) 
      ( 0.7408768360127569 0.03254725357623323 0 ) 
     ( 0.7545207068400739 0.031131062591835772 0 ) 
     ( 0.7679133964589709 0.029716735160824584 0 ) 
     ( 0.7810416879017434 0.028307152476966586 0 ) 
     ( 0.7938926251297652 0.026905165683561088 0 ) 
     ( 0.8064535258195331 0.025513599510003003 0 ) 
     ( 0.8187119938785907 0.024135255460103984 0 ) 
      ( 0.8306559316789744 0.02277291440649534 0 ) 
     ( 0.8422735519961111 0.021429338460774792 0 ) 
       ( 0.853553389641386 0.02010727200658126 0 ) 
     ( 0.8644843127769004 0.018809441802148802 0 ) 
     ( 0.8750555339012502 0.017538556079751286 0 ) 
      ( 0.8852566204954886 0.01629730259141577 0 ) 
     ( 0.8950775053187623 0.015088345572964366 0 ) 
     ( 0.9045084963434626 0.013914321621431396 0 ) 
     ( 0.9135402863200868 0.012777834503793497 0 ) 
     ( 0.9221639619623694 0.011681448937340355 0 ) 
     ( 0.9303710127436202 0.010627683403513903 0 ) 
     ( 0.9381533392955854 0.009619002077284352 0 ) 
     ( 0.9455032614015477 0.008657805972762672 0 ) 
    ( 0.9524135255757721 0.0077464234224554505 0 ) 
    ( 0.9588773122218202 0.0068871000220674244 0 ) 
     ( 0.9648882423626697 0.006081988184805304 0 ) 
      ( 0.9704403839359932 0.00533313645853706 0 ) 
    ( 0.9755282576483886 0.0046424787657607545 0 ) 
     ( 0.9801468423827797 0.004011823730030825 0 ) 
     ( 0.9842915801536527 0.003442844253230776 0 ) 
    ( 0.9879583806052372 0.0029370675058600915 0 ) 
     ( 0.9911436250481941 0.002495865487379323 0 ) 
    ( 0.9938441700308243 0.0021204463057212714 0 ) 
    ( 0.9960573504412771 0.0018118463144844998 0 ) 
     ( 0.9977809821376927 0.001570923233267704 0 ) 
    ( 0.9990133641036874 0.0013983503613144931 0 ) 
    ( 0.9997532801270506 0.0012946119774001064 0 ) 
                   ( 1.0 0.0012599999999999777 0 )  
    )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.002779436645883411 1 ) 
 ( 0.0009866357836101902 0.0055207177552717215 1 ) 
  ( 0.0022190176933925554 0.008222748469206773 1 ) 
    ( 0.003942649333762649 0.01088417002178607 1 ) 
   ( 0.006155829688391956 0.013503368107714511 1 ) 
     ( 0.008856374615475837 0.0160784843878458 1 ) 
   ( 0.012041619003218151 0.018607430994161976 1 ) 
   ( 0.015708419399974638 0.021087907859323664 1 ) 
      ( 0.01985315711646002 0.0235174226619916 1 ) 
    ( 0.02447174179695788 0.025893313148021294 1 ) 
   ( 0.029559615456007327 0.028212771559787245 1 ) 
    ( 0.03511175697658486 0.030472870881672068 1 ) 
    ( 0.04112268706534028 0.032670592589468826 1 ) 
    ( 0.047586473659998074 0.03480285557535908 1 ) 
    ( 0.05449673778358616 0.036866545908436056 1 ) 
     ( 0.06184665983971649 0.03885854708358349 1 ) 
     ( 0.06962898634270315 0.04077577040896082 1 ) 
     ( 0.07783603707587677 0.04261518518439328 1 ) 
      ( 0.08645971267103159 0.0443738483295568 1 ) 
      ( 0.0954915026015235 0.04604893313185716 1 ) 
    ( 0.10492249358113281 0.047637756799143026 1 ) 
     ( 0.11474337836040116 0.04913780652161402 1 ) 
     ( 0.12494446491176331 0.05054676377018551 1 ) 
     ( 0.13551568599440833 0.05186252658479674 1 ) 
      ( 0.1464466090894303 0.05308322963530017 1 ) 
     ( 0.1577264466954656 0.054207261869206845 1 ) 
    ( 0.16934406697465365 0.055233281594217774 1 ) 
     ( 0.18128800473841744 0.05616022887864529 1 ) 
      ( 0.1935464727622202 0.05698733518901062 1 ) 
     ( 0.20610737341813284 0.05771413022076888 1 ) 
    ( 0.21895831061373222 0.058340445914735764 1 ) 
      ( 0.2320866020255476 0.05886641768784984 1 ) 
    ( 0.24547929161498316 0.059292482941897026 1 ) 
     ( 0.2591231624143632 0.059619376947259925 1 ) 
      ( 0.273004749570484 0.059848126230179294 1 ) 
       ( 0.287110353632798 0.05998003962100488 1 ) 
     ( 0.30142605407311807 0.06001669714708335 1 ) 
       ( 0.315937723023497 0.05995993697694939 1 ) 
     ( 0.3306310392187286 0.059811840642063574 1 ) 
       ( 0.345491502129707 0.05957471677824865 1 ) 
     ( 0.3605044462736979 0.059251083641041015 1 ) 
      ( 0.3756550556873999 0.05884365065728139 1 ) 
      ( 0.3909283785485107 0.05835529927936968 1 ) 
     ( 0.40630934193137186 0.05778906340870699 1 ) 
      ( 0.4217827666821252 0.05714810965101878 1 ) 
      ( 0.43733338239870584 0.0564357176586197 1 ) 
      ( 0.4529458425008854 0.05565526080343141 1 ) 
       ( 0.468604739375493 0.05481018740993586 1 ) 
      ( 0.4842946195818704 0.05390400275952326 1 ) 
      ( 0.4999999991025516 0.05294025205721042 1 ) 
      ( 0.5157053786241185 0.05192250452882564 1 ) 
       ( 0.5313952588331522 0.0508543387918836 1 ) 
      ( 0.5470541557121839 0.04973932961693614 1 ) 
      ( 0.5626666158205507 0.04858103616862363 1 ) 
      ( 0.5782172315450762 0.04738299178742663 1 ) 
      ( 0.593690656305524 0.046148695344689634 1 ) 
       ( 0.6090716196998196 0.0448816041753126 1 ) 
      ( 0.6243449425740935 0.04358512856503597 1 ) 
      ( 0.6394955520026742 0.04226262774290181 1 ) 
      ( 0.6545084961632448 0.04091740730467613 1 ) 
      ( 0.6693689590924875 0.03955271797012939 1 ) 
     ( 0.6840622753076503 0.038171755556445454 1 ) 
     ( 0.6985739442796073 0.036777662031955226 1 ) 
      ( 0.7128896447431308 0.03537352749912887 1 ) 
     ( 0.7269952488302514 0.033962392943514365 1 ) 
      ( 0.7408768360127569 0.03254725357623323 1 ) 
     ( 0.7545207068400739 0.031131062591835772 1 ) 
     ( 0.7679133964589709 0.029716735160824584 1 ) 
     ( 0.7810416879017434 0.028307152476966586 1 ) 
     ( 0.7938926251297652 0.026905165683561088 1 ) 
     ( 0.8064535258195331 0.025513599510003003 1 ) 
     ( 0.8187119938785907 0.024135255460103984 1 ) 
      ( 0.8306559316789744 0.02277291440649534 1 ) 
     ( 0.8422735519961111 0.021429338460774792 1 ) 
       ( 0.853553389641386 0.02010727200658126 1 ) 
     ( 0.8644843127769004 0.018809441802148802 1 ) 
     ( 0.8750555339012502 0.017538556079751286 1 ) 
      ( 0.8852566204954886 0.01629730259141577 1 ) 
     ( 0.8950775053187623 0.015088345572964366 1 ) 
     ( 0.9045084963434626 0.013914321621431396 1 ) 
     ( 0.9135402863200868 0.012777834503793497 1 ) 
     ( 0.9221639619623694 0.011681448937340355 1 ) 
     ( 0.9303710127436202 0.010627683403513903 1 ) 
     ( 0.9381533392955854 0.009619002077284352 1 ) 
     ( 0.9455032614015477 0.008657805972762672 1 ) 
    ( 0.9524135255757721 0.0077464234224554505 1 ) 
    ( 0.9588773122218202 0.0068871000220674244 1 ) 
     ( 0.9648882423626697 0.006081988184805304 1 ) 
      ( 0.9704403839359932 0.00533313645853706 1 ) 
    ( 0.9755282576483886 0.0046424787657607545 1 ) 
     ( 0.9801468423827797 0.004011823730030825 1 ) 
     ( 0.9842915801536527 0.003442844253230776 1 ) 
    ( 0.9879583806052372 0.0029370675058600915 1 ) 
     ( 0.9911436250481941 0.002495865487379323 1 ) 
    ( 0.9938441700308243 0.0021204463057212714 1 ) 
    ( 0.9960573504412771 0.0018118463144844998 1 ) 
     ( 0.9977809821376927 0.001570923233267704 1 ) 
    ( 0.9990133641036874 0.0013983503613144931 1 ) 
    ( 0.9997532801270506 0.0012946119774001064 1 ) 
                   ( 1.0 0.0012599999999999777 1 )  
	)																																																													
	spline	0	6													
	(
                                         ( 0.0 -0.0 0 ) 
 ( 0.00024671981657042874 -0.002779436645883411 0 ) 
 ( 0.0009866357836101902 -0.0055207177552717215 0 ) 
  ( 0.0022190176933925554 -0.008222748469206773 0 ) 
    ( 0.003942649333762649 -0.01088417002178607 0 ) 
   ( 0.006155829688391956 -0.013503368107714511 0 ) 
     ( 0.008856374615475837 -0.0160784843878458 0 ) 
   ( 0.012041619003218151 -0.018607430994161976 0 ) 
   ( 0.015708419399974638 -0.021087907859323664 0 ) 
      ( 0.01985315711646002 -0.0235174226619916 0 ) 
    ( 0.02447174179695788 -0.025893313148021294 0 ) 
   ( 0.029559615456007327 -0.028212771559787245 0 ) 
    ( 0.03511175697658486 -0.030472870881672068 0 ) 
    ( 0.04112268706534028 -0.032670592589468826 0 ) 
    ( 0.047586473659998074 -0.03480285557535908 0 ) 
    ( 0.05449673778358616 -0.036866545908436056 0 ) 
     ( 0.06184665983971649 -0.03885854708358349 0 ) 
     ( 0.06962898634270315 -0.04077577040896082 0 ) 
     ( 0.07783603707587677 -0.04261518518439328 0 ) 
      ( 0.08645971267103159 -0.0443738483295568 0 ) 
      ( 0.0954915026015235 -0.04604893313185716 0 ) 
    ( 0.10492249358113281 -0.047637756799143026 0 ) 
     ( 0.11474337836040116 -0.04913780652161402 0 ) 
     ( 0.12494446491176331 -0.05054676377018551 0 ) 
     ( 0.13551568599440833 -0.05186252658479674 0 ) 
      ( 0.1464466090894303 -0.05308322963530017 0 ) 
     ( 0.1577264466954656 -0.054207261869206845 0 ) 
    ( 0.16934406697465365 -0.055233281594217774 0 ) 
     ( 0.18128800473841744 -0.05616022887864529 0 ) 
      ( 0.1935464727622202 -0.05698733518901062 0 ) 
     ( 0.20610737341813284 -0.05771413022076888 0 ) 
    ( 0.21895831061373222 -0.058340445914735764 0 ) 
      ( 0.2320866020255476 -0.05886641768784984 0 ) 
    ( 0.24547929161498316 -0.059292482941897026 0 ) 
     ( 0.2591231624143632 -0.059619376947259925 0 ) 
      ( 0.273004749570484 -0.059848126230179294 0 ) 
       ( 0.287110353632798 -0.05998003962100488 0 ) 
     ( 0.30142605407311807 -0.06001669714708335 0 ) 
       ( 0.315937723023497 -0.05995993697694939 0 ) 
     ( 0.3306310392187286 -0.059811840642063574 0 ) 
       ( 0.345491502129707 -0.05957471677824865 0 ) 
     ( 0.3605044462736979 -0.059251083641041015 0 ) 
      ( 0.3756550556873999 -0.05884365065728139 0 ) 
      ( 0.3909283785485107 -0.05835529927936968 0 ) 
     ( 0.40630934193137186 -0.05778906340870699 0 ) 
      ( 0.4217827666821252 -0.05714810965101878 0 ) 
      ( 0.43733338239870584 -0.0564357176586197 0 ) 
      ( 0.4529458425008854 -0.05565526080343141 0 ) 
       ( 0.468604739375493 -0.05481018740993586 0 ) 
      ( 0.4842946195818704 -0.05390400275952326 0 ) 
      ( 0.4999999991025516 -0.05294025205721042 0 ) 
      ( 0.5157053786241185 -0.05192250452882564 0 ) 
       ( 0.5313952588331522 -0.0508543387918836 0 ) 
      ( 0.5470541557121839 -0.04973932961693614 0 ) 
      ( 0.5626666158205507 -0.04858103616862363 0 ) 
      ( 0.5782172315450762 -0.04738299178742663 0 ) 
      ( 0.593690656305524 -0.046148695344689634 0 ) 
       ( 0.6090716196998196 -0.0448816041753126 0 ) 
      ( 0.6243449425740935 -0.04358512856503597 0 ) 
      ( 0.6394955520026742 -0.04226262774290181 0 ) 
      ( 0.6545084961632448 -0.04091740730467613 0 ) 
      ( 0.6693689590924875 -0.03955271797012939 0 ) 
     ( 0.6840622753076503 -0.038171755556445454 0 ) 
     ( 0.6985739442796073 -0.036777662031955226 0 ) 
      ( 0.7128896447431308 -0.03537352749912887 0 ) 
     ( 0.7269952488302514 -0.033962392943514365 0 ) 
      ( 0.7408768360127569 -0.03254725357623323 0 ) 
     ( 0.7545207068400739 -0.031131062591835772 0 ) 
     ( 0.7679133964589709 -0.029716735160824584 0 ) 
     ( 0.7810416879017434 -0.028307152476966586 0 ) 
     ( 0.7938926251297652 -0.026905165683561088 0 ) 
     ( 0.8064535258195331 -0.025513599510003003 0 ) 
     ( 0.8187119938785907 -0.024135255460103984 0 ) 
      ( 0.8306559316789744 -0.02277291440649534 0 ) 
     ( 0.8422735519961111 -0.021429338460774792 0 ) 
       ( 0.853553389641386 -0.02010727200658126 0 ) 
     ( 0.8644843127769004 -0.018809441802148802 0 ) 
     ( 0.8750555339012502 -0.017538556079751286 0 ) 
      ( 0.8852566204954886 -0.01629730259141577 0 ) 
     ( 0.8950775053187623 -0.015088345572964366 0 ) 
     ( 0.9045084963434626 -0.013914321621431396 0 ) 
     ( 0.9135402863200868 -0.012777834503793497 0 ) 
     ( 0.9221639619623694 -0.011681448937340355 0 ) 
     ( 0.9303710127436202 -0.010627683403513903 0 ) 
     ( 0.9381533392955854 -0.009619002077284352 0 ) 
     ( 0.9455032614015477 -0.008657805972762672 0 ) 
    ( 0.9524135255757721 -0.0077464234224554505 0 ) 
    ( 0.9588773122218202 -0.0068871000220674244 0 ) 
     ( 0.9648882423626697 -0.006081988184805304 0 ) 
      ( 0.9704403839359932 -0.00533313645853706 0 ) 
    ( 0.9755282576483886 -0.0046424787657607545 0 ) 
     ( 0.9801468423827797 -0.004011823730030825 0 ) 
     ( 0.9842915801536527 -0.003442844253230776 0 ) 
    ( 0.9879583806052372 -0.0029370675058600915 0 ) 
     ( 0.9911436250481941 -0.002495865487379323 0 ) 
    ( 0.9938441700308243 -0.0021204463057212714 0 ) 
    ( 0.9960573504412771 -0.0018118463144844998 0 ) 
     ( 0.9977809821376927 -0.001570923233267704 0 ) 
    ( 0.9990133641036874 -0.0013983503613144931 0 ) 
    ( 0.9997532801270506 -0.0012946119774001064 0 ) 
                   ( 1.0 -0.0012599999999999777 0 )  
    )
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.002779436645883411 1 ) 
 ( 0.0009866357836101902 -0.0055207177552717215 1 ) 
  ( 0.0022190176933925554 -0.008222748469206773 1 ) 
    ( 0.003942649333762649 -0.01088417002178607 1 ) 
   ( 0.006155829688391956 -0.013503368107714511 1 ) 
     ( 0.008856374615475837 -0.0160784843878458 1 ) 
   ( 0.012041619003218151 -0.018607430994161976 1 ) 
   ( 0.015708419399974638 -0.021087907859323664 1 ) 
      ( 0.01985315711646002 -0.0235174226619916 1 ) 
    ( 0.02447174179695788 -0.025893313148021294 1 ) 
   ( 0.029559615456007327 -0.028212771559787245 1 ) 
    ( 0.03511175697658486 -0.030472870881672068 1 ) 
    ( 0.04112268706534028 -0.032670592589468826 1 ) 
    ( 0.047586473659998074 -0.03480285557535908 1 ) 
    ( 0.05449673778358616 -0.036866545908436056 1 ) 
     ( 0.06184665983971649 -0.03885854708358349 1 ) 
     ( 0.06962898634270315 -0.04077577040896082 1 ) 
     ( 0.07783603707587677 -0.04261518518439328 1 ) 
      ( 0.08645971267103159 -0.0443738483295568 1 ) 
      ( 0.0954915026015235 -0.04604893313185716 1 ) 
    ( 0.10492249358113281 -0.047637756799143026 1 ) 
     ( 0.11474337836040116 -0.04913780652161402 1 ) 
     ( 0.12494446491176331 -0.05054676377018551 1 ) 
     ( 0.13551568599440833 -0.05186252658479674 1 ) 
      ( 0.1464466090894303 -0.05308322963530017 1 ) 
     ( 0.1577264466954656 -0.054207261869206845 1 ) 
    ( 0.16934406697465365 -0.055233281594217774 1 ) 
     ( 0.18128800473841744 -0.05616022887864529 1 ) 
      ( 0.1935464727622202 -0.05698733518901062 1 ) 
     ( 0.20610737341813284 -0.05771413022076888 1 ) 
    ( 0.21895831061373222 -0.058340445914735764 1 ) 
      ( 0.2320866020255476 -0.05886641768784984 1 ) 
    ( 0.24547929161498316 -0.059292482941897026 1 ) 
     ( 0.2591231624143632 -0.059619376947259925 1 ) 
      ( 0.273004749570484 -0.059848126230179294 1 ) 
       ( 0.287110353632798 -0.05998003962100488 1 ) 
     ( 0.30142605407311807 -0.06001669714708335 1 ) 
       ( 0.315937723023497 -0.05995993697694939 1 ) 
     ( 0.3306310392187286 -0.059811840642063574 1 ) 
       ( 0.345491502129707 -0.05957471677824865 1 ) 
     ( 0.3605044462736979 -0.059251083641041015 1 ) 
      ( 0.3756550556873999 -0.05884365065728139 1 ) 
      ( 0.3909283785485107 -0.05835529927936968 1 ) 
     ( 0.40630934193137186 -0.05778906340870699 1 ) 
      ( 0.4217827666821252 -0.05714810965101878 1 ) 
      ( 0.43733338239870584 -0.0564357176586197 1 ) 
      ( 0.4529458425008854 -0.05565526080343141 1 ) 
       ( 0.468604739375493 -0.05481018740993586 1 ) 
      ( 0.4842946195818704 -0.05390400275952326 1 ) 
      ( 0.4999999991025516 -0.05294025205721042 1 ) 
      ( 0.5157053786241185 -0.05192250452882564 1 ) 
       ( 0.5313952588331522 -0.0508543387918836 1 ) 
      ( 0.5470541557121839 -0.04973932961693614 1 ) 
      ( 0.5626666158205507 -0.04858103616862363 1 ) 
      ( 0.5782172315450762 -0.04738299178742663 1 ) 
      ( 0.593690656305524 -0.046148695344689634 1 ) 
       ( 0.6090716196998196 -0.0448816041753126 1 ) 
      ( 0.6243449425740935 -0.04358512856503597 1 ) 
      ( 0.6394955520026742 -0.04226262774290181 1 ) 
      ( 0.6545084961632448 -0.04091740730467613 1 ) 
      ( 0.6693689590924875 -0.03955271797012939 1 ) 
     ( 0.6840622753076503 -0.038171755556445454 1 ) 
     ( 0.6985739442796073 -0.036777662031955226 1 ) 
      ( 0.7128896447431308 -0.03537352749912887 1 ) 
     ( 0.7269952488302514 -0.033962392943514365 1 ) 
      ( 0.7408768360127569 -0.03254725357623323 1 ) 
     ( 0.7545207068400739 -0.031131062591835772 1 ) 
     ( 0.7679133964589709 -0.029716735160824584 1 ) 
     ( 0.7810416879017434 -0.028307152476966586 1 ) 
     ( 0.7938926251297652 -0.026905165683561088 1 ) 
     ( 0.8064535258195331 -0.025513599510003003 1 ) 
     ( 0.8187119938785907 -0.024135255460103984 1 ) 
      ( 0.8306559316789744 -0.02277291440649534 1 ) 
     ( 0.8422735519961111 -0.021429338460774792 1 ) 
       ( 0.853553389641386 -0.02010727200658126 1 ) 
     ( 0.8644843127769004 -0.018809441802148802 1 ) 
     ( 0.8750555339012502 -0.017538556079751286 1 ) 
      ( 0.8852566204954886 -0.01629730259141577 1 ) 
     ( 0.8950775053187623 -0.015088345572964366 1 ) 
     ( 0.9045084963434626 -0.013914321621431396 1 ) 
     ( 0.9135402863200868 -0.012777834503793497 1 ) 
     ( 0.9221639619623694 -0.011681448937340355 1 ) 
     ( 0.9303710127436202 -0.010627683403513903 1 ) 
     ( 0.9381533392955854 -0.009619002077284352 1 ) 
     ( 0.9455032614015477 -0.008657805972762672 1 ) 
    ( 0.9524135255757721 -0.0077464234224554505 1 ) 
    ( 0.9588773122218202 -0.0068871000220674244 1 ) 
     ( 0.9648882423626697 -0.006081988184805304 1 ) 
      ( 0.9704403839359932 -0.00533313645853706 1 ) 
    ( 0.9755282576483886 -0.0046424787657607545 1 ) 
     ( 0.9801468423827797 -0.004011823730030825 1 ) 
     ( 0.9842915801536527 -0.003442844253230776 1 ) 
    ( 0.9879583806052372 -0.0029370675058600915 1 ) 
     ( 0.9911436250481941 -0.002495865487379323 1 ) 
    ( 0.9938441700308243 -0.0021204463057212714 1 ) 
    ( 0.9960573504412771 -0.0018118463144844998 1 ) 
     ( 0.9977809821376927 -0.001570923233267704 1 ) 
    ( 0.9990133641036874 -0.0013983503613144931 1 ) 
    ( 0.9997532801270506 -0.0012946119774001064 1 ) 
                   ( 1.0 -0.0012599999999999777 1 )  
							
    )															
                                                                    
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                                                                                
    boundary																
    (																
        inlet              																
            {																
            type patch;    																
            faces																
            (																
                (3 13 12 2)
                (8 18 13 3)
                (5 2 12 15)
                (8 9 19 18)															
            );																
            } 
        outlet              																
            {																
            type patch;    																
            faces																
            (																
                (4 5 15 14)
                (7 4 14 17)
                (7 17 19 9)  															
            );																
            }	

        foil              																
            {																
            type wall;    																
            faces																
            (																
                (0 1 11 10)
                (0 6 16 10)
                (6 1 11 16)															
            );																
            }	
                                                                
                                                                        
    );	
    // ************************************************************************* //																
                                                                    			               	
    