run/NACA4412__AoA0_kOmegaSST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       328790;
    }
    outlet
    {
        type            patch;
        nFaces          210;
        startFace       330390;
    }
    foil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          610;
        startFace       330600;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          330000;
        startFace       331210;
    }
)

// ************************************************************************* //
